Tekla.Structures.Model.BaseRebarModifier.BarsAffectedEnum
The reinforcing bars affected.

Tekla.Structures.Model.BaseRebarModifier.BarsAffectedEnum.ALL_BARS
All reinforcing bars.

Tekla.Structures.Model.BaseRebarModifier.BarsAffectedEnum.EVERY_SECOND_BAR
Every second reinforcing bar.

Tekla.Structures.Model.BaseRebarModifier.BarsAffectedEnum.EVERY_THIRD_BAR
Every third reinforcing bar.

Tekla.Structures.Model.BaseRebarModifier.BarsAffectedEnum.EVERY_FOURTH_BAR
Every fourth reinforcing bar.